src/test/java/com/organization/api/SoapRequestTemplates/GetGoldPriceSoap_GetCurrentGoldPrice.xml

<s11:Envelope xmlns:s11='http://schemas.xmlsoap.org/soap/envelope/'>
  <s11:Body>
    <ns1:GetCurrentGoldPrice xmlns:ns1='http://freewebservicesx.com/'>
<!-- optional -->
      <ns1:UserName>?XXX?</ns1:UserName>
<!-- optional -->
      <ns1:Password>?XXX?</ns1:Password>
    </ns1:GetCurrentGoldPrice>
  </s11:Body>
</s11:Envelope>